
'''
	Baekjoon - 14500. 테트로미노
	삼성 SW 역량 테스트 기출 문제
	언어 : Python
	메모리 : 34,548kb
	실행시간 : 5476ms
	코드길이 : 1094b
'''

tetromino= [
	[(0,0), (0,1), (1,0), (1,1)], # ㅁ
	[(0,0), (0,1), (0,2), (0,3)], # ㅡ
	[(0,0), (1,0), (2,0), (3,0)], # ㅣ
	[(0,0), (0,1), (0,2), (1,0)],
	[(1,0), (1,1), (1,2), (0,2)],
	[(0,0), (1,0), (1,1), (1,2)], # ㄴ
	[(0,0), (0,1), (0,2), (1,2)], # ㄱ
	[(0,0), (1,0), (2,0), (2,1)],
	[(2,0), (2,1), (1,1), (0,1)],
	[(0,0), (0,1), (1,0), (2,0)],
	[(0,0), (0,1), (1,1), (2,1)],
	[(0,0), (0,1), (0,2), (1,1)], # ㅜ
	[(1,0), (1,1), (1,2), (0,1)], # ㅗ
	[(0,0), (1,0), (2,0), (1,1)], # ㅏ
	[(1,0), (0,1), (1,1), (2,1)], # ㅓ
	[(1,0), (2,0), (0,1), (1,1)],
	[(0,0), (1,0), (1,1), (2,1)],
	[(1,0), (0,1), (1,1), (0,2)],
	[(0,0), (0,1), (1,1), (1,2)]
]

def solution():
	max_sum = 0
	for x in range(N):
		for y in range(M):
			for i in range(19):
				now_sum = 0
				for b in range(4):
					try:
						now_sum += paper[tetromino[i][b][0]+x][tetromino[i][b][1]+y]
					except IndexError:
						continue
				max_sum = max(now_sum, max_sum)
	return(max_sum)

N, M = list(map(int, input().split()))
paper = []
for _ in range(N):
	paper.append(list(map(int, input().split())))
print(solution())
